//============================================================================
// Name        : FunctionQuantity.c
// Author      : lancer
// Version     : 1.0
// Copyright   : made by lancer
// Description : Polynomial Function Operator in C, Ansi-style
//============================================================================

void FunctionQuantity(void){
	FunctionList();
	printf(" ┌─────────────────────────────────────┐\n");
	printf(" │┌───────────────────────────────────┐│\n");
	printf(" ││                               函数求值                               ││\n");
	printf(" │└───────────────────────────────────┘│\n");
	printf(" │┌───────────────────────────────────┐│\n");
	printf(" ││ 待求值函数编号:                                                      ││\n");
	printf(" │├───────────────────────────────────┤│\n");
	printf(" ││ x=                                                                   ││\n");
	printf(" ││ f(x)=                                                                ││\n");
	printf(" │└───────────────────────────────────┘│\n");
	printf(" └─────────────────────────────────────┘\n");
	Goto(22,FN+13);
	scanf("%d",&d);
	if(d<1||d>FN){
		Goto(1,FN+19);
		printf(" ┌─────────────────────────────────────┐\n");
		printf(" │┌───────────────────────────────────┐│\n");
		printf(" ││                               [!]提示                                ││\n");
		printf(" │└───────────────────────────────────┘│\n");
		printf(" │┌───────────────────────────────────┐│\n");
		printf(" ││                             输入错误，                               ││\n");
		printf(" ││                            请重新选择。                              ││\n");
		printf(" │└───────────────────────────────────┘│\n");
		printf(" └─────────────────────────────────────┘\n");
		getch();
		return;
	}
	LINE=16+FN;
	Goto(1,FN+16);
	LINE=LINE-d+1;
	List(d);
	Goto(9,FN+15);
	scanf("%lf",&x);
	Goto(1,FN+16);
	printf(" ││ f(x)=                                                                ││\n");
	p=rear[d];
	s=p->a;
	while(p!=head[d]){
		s*=x;
		p=p->piror;
		s+=p->a;
	}
	Goto(1,FN+16);
	printf(" ││ f%2d(%.2lf)=%.2lf",d,x,s);
	getch();
}
